<a href="https://colab.research.google.com/github/VitikaJain25/PandasRevision/blob/master/HandleMissingData_Replace.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [31]:
import pandas as pd
import numpy as np

from google.colab import files
uploaded = files.upload()

import io
df = pd.read_csv(io.BytesIO(uploaded['weather_data.csv']))

Saving weather_data.csv to weather_data (2).csv

In [32]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -88888   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [33]:
new_df = df.replace([-99999,-88888],np.NaN)   #Replacing list of values to NaN value using Replace Function ---  Numpy and Pandas 
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [34]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -88888   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [35]:
#---- Replace values based on specific column ---- By using a Dictionary 

new_df1 = df.replace({
    'temperature' : -99999,
    'windspeed' : (-99999,-88888),
    'event' : '0'
},np.NaN)
new_df1

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

In [36]:
# If you want to replace -99999 with NaN and "No Event" or 0 in event column with "Sunny"

new_df2 = df.replace({
    -99999 : np.NaN,
    '0' : "Sunny"
    })
new_df2

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0   -88888.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

In [39]:
# Regex -- Used to detect Patterns  -- When u want to replace patterns with some other value.
# If the column temperature and windspeed had values with unit for eg: 32F / 28C or 6 mph / 5 mph.

#First argument will be regular expression.
#Replace A-Z or a-b with blank value.

#OOPS.. It erased the vsalues in event column.

new_df3 = df.replace('[A-Za-z]','', regex = True)
new_df3

        day  temperature  windspeed event
0  1/1/2017           32          6
1  1/2/2017       -99999          7
2  1/3/2017           28     -99999
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -88888
5  1/6/2017           31          2
6  1/6/2017           34          5     0

In [40]:
#Event column should be untouched.
#Create a dictionary and mention which columns you want to replace.

new_df4 = df.replace({
    'temperature' : '[A-Za-z]',
    'windspeed' : '[A-Za-z]',
}, '' , regex = True)
new_df4

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -88888   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [41]:
#How you can replace a list of values with another list of values.
#Creating new DataFrame.

df_2 = pd.DataFrame({
    'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional'],
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica']
})
df_2

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor      tom
4      average   julian
5  exceptional    erica

In [42]:
#Now we want to replace numbers to the column "Score" -- Like 1 for Poor, 2 for good, 3 for average.. etc.. (Assume we already have an internal mapping for these)

df_2_new = df_2.replace(['poor','average','good','exceptional'], [1,2,3,4])
df_2_new

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1      tom
4      2   julian
5      4    erica